
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Начисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаСписок.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаСписок.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаСписок.ДатаОкончания;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = НачалоДня(ТекСтрокаСписок.ДатаНачала);
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаСписок.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаСписок.Сотрудник;
		Движение.Результат = 0;
		Движение.ИсходныеДанные = ТекСтрокаСписок.Величина;   
		Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Отпуск Тогда
			Движение.Результат = ТекСтрокаСписок.Величина;   
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаСписок Из Удержания Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаСписок.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаСписок.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаСписок.ДатаОкончания;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = НачалоДня(ТекСтрокаСписок.ДатаНачала);
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаСписок.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаСписок.Сотрудник;
		Движение.Результат = 0;
		Движение.ИсходныеДанные = ТекСтрокаСписок.Величина;
	КонецЦикла;
	
	Движения.ОсновныеНачисления.Записать();
	Движения.Удержания.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
	
	//ОСНОВНЫЕ НАЧИСЛЕНИЯ
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗарплатаСписок.Сотрудник
	|ИЗ
	|	Документ.Зарплата.Начисления
	|   КАК ЗарплатаСписок 
	|
	|ГДЕ
	|	ЗарплатаСписок.Ссылка = &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ТекущийДокумент", ссылка);
	
	ТаблЗнач = Запрос.Выполнить().Выгрузить();
	МассивСотрудников = ТаблЗнач.ВыгрузитьКолонку("Сотрудник");   
	СписокСотрудников = Новый СписокЗначений;
	СписокСотрудников.ЗагрузитьЗначения(МассивСотрудников);
	
	РассчитатьНачисления(Движения.ОсновныеНачисления, ПланыВидовРасчета.ОсновныеНачисления.ПоОкладу, СписокСотрудников); 
	Движения.ОсновныеНачисления.Записать(, Истина);
	
	РассчитатьНачисления(Движения.ОсновныеНачисления, ПланыВидовРасчета.ОсновныеНачисления.ДоплатаЗаСложность, СписокСотрудников); 
	Движения.ОсновныеНачисления.Записать(, Истина);
	
	РассчитатьНачисления(Движения.ОсновныеНачисления, ПланыВидовРасчета.ОсновныеНачисления.ДоплатаЗаИнтенсивность, СписокСотрудников); 
	Движения.ОсновныеНачисления.Записать(, Истина);
	
	//УДЕРЖАНИЯ
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗарплатаСписок.Сотрудник
	|ИЗ
	|	Документ.Зарплата.Удержания
	|   КАК ЗарплатаСписок 
	|
	|ГДЕ
	|	ЗарплатаСписок.Ссылка = &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ТекущийДокумент", ссылка);
	
	ТаблЗнач = Запрос.Выполнить().Выгрузить();
	МассивСотрудников = ТаблЗнач.ВыгрузитьКолонку("Сотрудник");   
	СписокСотрудников = Новый СписокЗначений;
	СписокСотрудников.ЗагрузитьЗначения(МассивСотрудников);
	
	РассчитатьУдержания(Движения.Удержания, ПланыВидовРасчета.Удержания.Профвзносы, СписокСотрудников); 
	Движения.Удержания.Записать(, Истина);
	
КонецПроцедуры


Процедура РассчитатьНачисления(НаборДвижений, ВыбВидРасчета, СписокСотрудников)    
	Если ВыбВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.ПоОкладу Тогда
		Для каждого Движение из НаборДвижений Цикл
			Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.ПоОкладу Тогда
				ФактическиОтработано = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия);
				ОтраотаноПоПлану = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
				Движение.Результат = Движение.ИсходныеДанные*ФактическиОтработано[0].Значение/ОтраотаноПоПлану[0].Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;    
	
	Если ВыбВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.ДоплатаЗаСложность Тогда
		Ресурсы = Новый Массив(1);
		Ресурсы[0] = "ОсновныеНачисления.Результат";
		Измерения = Новый Структура("Сотрудник", "ОсновныеНачисления.Сотрудник");
		Для каждого Движение из НаборДвижений Цикл
			Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.ДоплатаЗаСложность Тогда
				БазаРасчета = Движение.ПолучитьБазу(Ресурсы, Измерения);  
				Движение.Результат = Движение.ИсходныеДанные*БазаРасчета[0].Результат/100;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Если ВыбВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.ДоплатаЗаИнтенсивность Тогда
		Ресурсы = Новый Массив(1);
		Ресурсы[0] = "ОсновныеНачисления.Результат";
		Измерения = Новый Структура("Сотрудник", "ОсновныеНачисления.Сотрудник");
		Для каждого Движение из НаборДвижений Цикл
			Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.ДоплатаЗаИнтенсивность Тогда
				БазаРасчета = Движение.ПолучитьБазу(Ресурсы, Измерения);  
				Движение.Результат = Движение.ИсходныеДанные*БазаРасчета[0].Результат/100 + Движение.Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьУдержания(НаборДвижений, ВыбВидРасчета, СписокСотрудников)     
	Если ВыбВидРасчета = ПланыВидовРасчета.Удержания.Профвзносы Тогда
		Ресурсы = Новый Массив(1);
		Ресурсы[0] = "ОсновныеНачисления.Результат";
		Измерения = Новый Структура("Сотрудник", "ОсновныеНачисления.Сотрудник");
		Для каждого Движение из НаборДвижений Цикл
			Если Движение.ВидРасчета = ПланыВидовРасчета.Удержания.Профвзносы Тогда
				БазаРасчета = Движение.ПолучитьБазу(Ресурсы, Измерения);  
				Движение.Результат = Движение.ИсходныеДанные*БазаРасчета[0].Результат/100;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры