&НаСервере
Функция ПолучитьЦену(ТоварДокумента)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент ",Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор ",Объект.Договор);
	СтруктураОтбора.Вставить("Товар ", ТоварДокумента);
	РезультатОтбора = РегистрыСведений.ЦеныОтПроизводителя.Получить(СтруктураОтбора);
	Возврат РезультатОтбора.Цена;
КонецФункции


&НаКлиенте
Процедура ПриходТовараТоварПриИзменении(Элемент)
	СтрокаРасчета = Элементы.ПриходТовара.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Товар);
	ПриходТовараЦенаПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ПриходТовараКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПриходТовара.ТекущиеДанные;
	СерверныеПроцедурыАвтоСумма.АвтоСумма(СтрокаТабличнойЧасти);
КонецПроцедуры   

&НаКлиенте
Процедура ПриходТовараЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПриходТовара.ТекущиеДанные;
	СерверныеПроцедурыАвтоСумма.АвтоСумма(СтрокаТабличнойЧасти);
КонецПроцедуры



