
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры   

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры


&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	Строка = Элементы.Услуги.ТекущиеДанные;
	Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры   

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	Строка = Элементы.Услуги.ТекущиеДанные;
	Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры
