
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасходТовара
	Движения.РасходТовара.Записывать = Истина;
	Для Каждого ТекСтрокаУходТовара Из УходТовара Цикл
		Движение = Движения.РасходТовара.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаУходТовара.Товар;
		Движение.Цена = ТекСтрокаУходТовара.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
