
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.УходТовара.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УходТовара.Дата,
	|	УходТовара.Договор,
	|	УходТовара.Контрагент,
	|	УходТовара.Номер,
	|	УходТовара.Склад,
	|	УходТовара.Сотрудник,
	|	УходТовара.УходТовараТЧ.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.УходТовара КАК УходТовара
	|ГДЕ
	|	УходТовара.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУходТовараТЧШапка = Макет.ПолучитьОбласть("УходТовараТЧШапка");
	ОбластьУходТовараТЧ = Макет.ПолучитьОбласть("УходТовараТЧ");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУходТовараТЧШапка);
		ВыборкаУходТовараТЧ = Выборка.УходТовараТЧ.Выбрать();
		Пока ВыборкаУходТовараТЧ.Следующий() Цикл
			ОбластьУходТовараТЧ.Параметры.Заполнить(ВыборкаУходТовараТЧ);
			ТабДок.Вывести(ОбластьУходТовараТЧ, ВыборкаУходТовараТЧ.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
