
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОборотТоваров Расход
	Движения.ОборотТоваров.Записывать = Истина;   
	Для Каждого ТекСтрокаТовар Из УходТовараТЧ Цикл
		сообщить(ТекСтрокаТовар.Сумма);
		Движение = Движения.ОборотТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовар.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовар.Количество;
		Движение.Сумма = ТекСтрокаТовар.Сумма;
		Движения.Записать();
	КонецЦикла;

	// регистр ОстатокТоваровНаСкладе Расход
	Движения.ОстатокТоваровНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТовар Из УходТовараТЧ Цикл
		Движение = Движения.ОстатокТоваровНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовар.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовар.Количество;
		Движения.Записать();
	КонецЦикла;
	
	ЗапросОстатков = Новый Запрос;
	ЗапросОстатков.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросОстатков.Текст =
	"ВЫБРАТЬ
	|	ОстатокТоваровНаСкладеОстатки.Товар КАК Товар,
	|	ОстатокТоваровНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстатокТоваровНаСкладе.Остатки КАК ОстатокТоваровНаСкладеОстатки
	|ГДЕ
	|	ОстатокТоваровНаСкладеОстатки.КоличествоОстаток < 0";
	
	РезультатЗапроса = ЗапросОстатков.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не хватает " + Строка(- ВыборкаДетальныеЗаписи.КоличествоОстаток) +
		" единиц материала """ + ВыборкаДетальныеЗаписи.Товар + """";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
