//выводит сообщение при открытии калькулятора
&НаКлиенте     
Процедура ПриОткрытии(Отказ)  
	ТекущаяДата = Формат(ТекущаяДата(), "ДЛФ=Д");      
	Сообщить(ТекущаяДата);
	Сообщить("Вы открыли форму обработки _Калькулятор_!");
КонецПроцедуры

//  процедура закрытие окна калькулятора
&НаКлиенте
Процедура Закрытие(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

 //Очистка буфера и табло
&НаКлиенте
Процедура Очистка(Команда)
	Табло = 0;  
	Буфер = 0;
	Сообщить("Табло и буфер успешно очищены!");
КонецПроцедуры

//Процедура кнопки info, выводит форму инфо
&НаКлиенте
Процедура Инфо(Команда)
	ОткрытьФорму("Обработка.Калькулятор.Форма.Инфо");
КонецПроцедуры


//перечисление операций с двумя переменными 
&НаКлиенте
Процедура Умножение(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Умножение";
КонецПроцедуры 

&НаКлиенте
Процедура Деление(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Деление";
КонецПроцедуры        

&НаКлиенте
Процедура Сложение(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Сложение";
КонецПроцедуры               

&НаКлиенте
Процедура Вычитание(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Вычитание";
КонецПроцедуры     


&НаКлиенте
Процедура Степень(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Степень";
КонецПроцедуры  

//считаем итоговый результат двух чисел
&НаКлиенте
Процедура Равно(Команда)
	Если Операция = "Сложение" Тогда
		Табло = Буфер + Табло;
	ИначеЕсли Операция = "Вычитание" Тогда
		Табло = Буфер - Табло;
	ИначеЕсли Операция = "Умножение" Тогда
		Табло = Буфер * Табло;	
	ИначеЕсли Операция = "Деление" Тогда
		Табло = Буфер / Табло;	
	ИначеЕсли Операция = "Степень" Тогда
		Табло = Pow(Буфер,Табло);  
	КонецЕсли;
		
КонецПроцедуры


//мгновенные процедуры, считает только одно число
&НаКлиенте
Процедура Знаменатель(Команда)
	Буфер = Табло;
	Табло = 1/Буфер;
КонецПроцедуры


&НаКлиенте
Процедура Корень(Команда)
	Буфер = Табло;
	Табло = sqrt(Буфер); 
КонецПроцедуры

&НаКлиенте
Процедура Факториал(Команда)
	ФакториалФунк(Табло);
	Табло = ФакториалФунк(Табло)	
КонецПроцедуры  

&НаКлиенте
Процедура Акос(Команда)
  Буфер = Табло;
  Табло = ACos(Буфер);
КонецПроцедуры

&НаКлиенте
Процедура Асин(Команда) 
  Буфер = Табло;
  Табло = ASin(Буфер);
КонецПроцедуры

&НаКлиенте
Процедура Кос(Команда) 
  Буфер = Табло;
  Табло = Cos(Буфер);
КонецПроцедуры

&НаКлиенте
Процедура Син(Команда) 
  Буфер = Табло;
  Табло = Sin(Буфер);
КонецПроцедуры

&НаКлиенте
Процедура Тан(Команда) 
  Буфер = Табло;
  Табло = Tan(Буфер);
КонецПроцедуры

&НаКлиенте
Процедура Экспонента(Команда) 
  Буфер = Табло;
  Табло = Exp(Буфер);
КонецПроцедуры




//функция определяющая знак введенного значения, если 0 и меньше - выводит 1, если больше считает
Функция ФакториалФунк(Знач Значение)
	Если Значение <= 0 Тогда Возврат 1 КонецЕсли;
	Возврат Значение * ФакториалФунк(Значение-1);
КонецФункции 


//перечисление процедур вывода элементов на табло

&НаКлиенте
Процедура Запятая(Команда)
	ВыводЗапятой = ",";
	Табло = Табло + Лев(ВыводЗапятой, 9);
	Табло = Прав(Табло, 11);
КонецПроцедуры


&НаКлиенте
Процедура Цифра0(Команда)
	ВыводЦифры0 = 0;
	Табло = Табло + Лев(ВыводЦифры0, 9);
	Табло = Прав(Число(Табло), 11);
КонецПроцедуры  

&НаКлиенте
Процедура Цифра1(Команда)
	ВыводЦифры1 = 1;
	Табло = Табло + Лев(ВыводЦифры1, 9);
	Табло = Прав(Число(Табло), 11);
КонецПроцедуры  

&НаКлиенте
Процедура Цифра2(Команда)
	ВыводЦифры2 = 2;
	Табло = Табло + Лев(ВыводЦифры2, 9);
	Табло = Прав(Число(Табло), 11);

КонецПроцедуры  

&НаКлиенте
Процедура Цифра3(Команда)
	ВыводЦифры3 = 3;
	Табло = Табло + Лев(ВыводЦифры3, 9);
	Табло = Прав(Число(Табло), 11);

КонецПроцедуры  

&НаКлиенте
Процедура Цифра4(Команда)
	ВыводЦифры4 = 4;
	Табло = Табло + Лев(ВыводЦифры4, 9);
	Табло = Прав(Число(Табло), 11);
КонецПроцедуры  

&НаКлиенте
Процедура Цифра5(Команда)
	ВыводЦифры5 = 5;
	Табло = Табло + Лев(ВыводЦифры5, 9);
	Табло = Прав(Число(Табло), 11);

КонецПроцедуры  

&НаКлиенте
Процедура Цифра6(Команда)
	ВыводЦифры6 = 6;
	Табло = Табло + Лев(ВыводЦифры6, 9);
	Табло = Прав(Число(Табло), 11);
КонецПроцедуры  

&НаКлиенте
Процедура Цифра7(Команда)
	ВыводЦифры7 = 7;
	Табло = Табло + Лев(ВыводЦифры7, 9);
	Табло = Прав(Число(Табло), 11);
КонецПроцедуры  

&НаКлиенте
Процедура Цифра8(Команда)
	ВыводЦифры8 = 8;
	Табло = Табло + Лев(ВыводЦифры8, 9);
	Табло = Прав(Число(Табло), 11);
КонецПроцедуры  

&НаКлиенте
Процедура Цифра9(Команда)
	ВыводЦифры9 = 9;
	Табло = Табло + Лев(ВыводЦифры9, 9);
	Табло = Прав(Число(Табло), 11);
КонецПроцедуры    

 




