&НаСервере
Процедура JSONНаСервере()

    Запрос = Новый Запрос;
    Запрос.Текст = Запросы;
	
	РезультатЗапроса = Запрос.Выполнить();
    ТаблицаРезультата = РезультатЗапроса.Выгрузить();
     
    Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("C:\файлы\для учёбы\Маг курс 1 сем 2\1с\лаб 5\1.json",,,Новый ПараметрыЗаписиJSON(,Символы.Таб)); 

	СериализаторXDTO.ЗаписатьJSON(Запись, ТаблицаРезультата);
	                                                     
    Запись.Закрыть();
КонецПроцедуры

&НаСервере
Процедура JSONTextСервер()
	
    Запрос = Новый Запрос;
    Запрос.Текст = Запросы;
	
	РезультатЗапроса = Запрос.Выполнить();
    ТаблицаРезультата = РезультатЗапроса.Выгрузить();
     
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));
	
    СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,ТаблицаРезультата); 
	ТекстJSON = ЗаписьJSON.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура JSONload(Команда)
    JSONНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура JSONText(Команда)
    JSONTextСервер();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
    ТекстJSON = "";
	Запросы= "";
КонецПроцедуры