Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ                                           	
	Для Каждого ТекСтрокаТМЦ Из ТМЦТЧ Цикл   
		Движение = Движения.ЖурналОпераций.Добавить();
		Движение.Период = Дата;                                        
		Если Строка(ТекСтрокаТМЦ.ВидТМЦ)=Строка(Перечисления.ВидыТМЦ.ОсновныеСредства) Тогда
			Движение.СчетДт=ПланыСчетов.ХозрасчетныйПлан.ОсновныеСредства;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства]=ТекСтрокаТМЦ.ТМЦ;
			Движение.КоличествоДт=ТекСтрокаТМЦ.Количество;
			Движение.Комментарий="Безвозмездное поступление ОС";
		ИначеЕсли Строка(ТекСтрокаТМЦ.ВидТМЦ)=Строка(Перечисления.ВидыТМЦ.Номенклатура) Тогда   
			сообщить(ТекСтрокаТМЦ.ВидТМЦ);
			Движение.СчетДт=ПланыСчетов.ХозрасчетныйПлан.Номенклатура;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура]=ТекСтрокаТМЦ.ТМЦ;
			Движение.КоличествоДт=ТекСтрокаТМЦ.Количество;
			Движение.Комментарий="Безвозмездное поступление номенклатуры";
		ИначеЕсли Строка(ТекСтрокаТМЦ.ВидТМЦ)=Строка(Перечисления.ВидыТМЦ.РасчетныйСчет) Тогда
			Движение.СчетДт=ПланыСчетов.ХозрасчетныйПлан.РасчетныйСчет;	
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет]=ТекСтрокаТМЦ.ТМЦ;
			Движение.Комментарий="Безвозмездное посутпление денежных средств";
		КонецЕСли;
		Движение.СчетКт=ПланыСчетов.ХозрасчетныйПлан.БезвозмездноеПоступление; 
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент]=ТекСтрокаТМЦ.Контрагент;
		Движение.Сумма = ТекСтрокаТМЦ.Стоимость;
	КонецЦикла;
	// записываем движения регистров
	Движения.ЖурналОпераций.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры