
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.СписокСотрудников.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокСотрудников.Код,
	|	СписокСотрудников.Наименование,
	|	СписокСотрудников.Пол,
	|	СписокСотрудников.ТипРаботника,
	|	СписокСотрудников.ИнформацияОСемье.(
	|		НомерСтроки,
	|		ФИО,
	|		ДатаРождения,
	|		Пол,
	|		ТипРодственности,
	|		МестоЖительства
	|	)
	|ИЗ
	|	Справочник.СписокСотрудников КАК СписокСотрудников
	|ГДЕ
	|	СписокСотрудников.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИнформацияОСемьеШапка = Макет.ПолучитьОбласть("ИнформацияОСемьеШапка");
	ОбластьИнформацияОСемье = Макет.ПолучитьОбласть("ИнформацияОСемье");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьИнформацияОСемьеШапка);
		ВыборкаИнформацияОСемье = Выборка.ИнформацияОСемье.Выбрать();
		Пока ВыборкаИнформацияОСемье.Следующий() Цикл
			ОбластьИнформацияОСемье.Параметры.Заполнить(ВыборкаИнформацияОСемье);
			ТабДок.Вывести(ОбластьИнформацияОСемье, ВыборкаИнформацияОСемье.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
