
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходТовара.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходТовара.Дата,
	|	ПриходТовара.Договор,
	|	ПриходТовара.Контрагент,
	|	ПриходТовара.Номер,
	|	ПриходТовара.Склад,
	|	ПриходТовара.Сотрудник,
	|	ПриходТовара.ПриходТовараТЧ.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПриходТовара КАК ПриходТовара
	|ГДЕ
	|	ПриходТовара.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПриходТовараТЧШапка = Макет.ПолучитьОбласть("ПриходТовараТЧШапка");
	ОбластьПриходТовараТЧ = Макет.ПолучитьОбласть("ПриходТовараТЧ");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПриходТовараТЧШапка);
		ВыборкаПриходТовараТЧ = Выборка.ПриходТовараТЧ.Выбрать();
		Пока ВыборкаПриходТовараТЧ.Следующий() Цикл
			ОбластьПриходТовараТЧ.Параметры.Заполнить(ВыборкаПриходТовараТЧ);
			ТабДок.Вывести(ОбластьПриходТовараТЧ, ВыборкаПриходТовараТЧ.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
