
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстатокТоваровНаСкладе Приход
	Движения.ОстатокТоваровНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаПриходТовараТЧ Из ПриходТовараТЧ Цикл
		Движение = Движения.ОстатокТоваровНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаПриходТовара.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаПриходТовара.Количество;
	КонецЦикла;

	// регистр ОборотТоваров Приход
	Движения.ОборотТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаПриходТовараТЧ Из ПриходТовараТЧ Цикл
		Движение = Движения.ОборотТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаПриходТовараТЧ.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаПриходТовараТЧ.Количество;
		Движение.Сумма = ТекСтрокаПриходТовараТЧ.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
